---
type: Stairs
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 17
tags: [revit-api, class]
---

# Stairs

`Autodesk.Revit.DB.Architecture.Stairs` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAssociatedRailings | 2013 | `public ICollection < ElementId > GetAssociatedRailings ()` |
| Method | GetStairsLandings | 2013 | `public ICollection < ElementId > GetStairsLandings ()` |
| Method | GetStairsRuns | 2013 | `public ICollection < ElementId > GetStairsRuns ()` |
| Method | GetStairsSupports | 2013 | `public ICollection < ElementId > GetStairsSupports ()` |
| Method | IsByComponent | 2013 | `public static bool IsByComponent ( Document document , ElementId stairsId )` |
| Method | IsInEditMode | 2013 | `public bool IsInEditMode ()` |
| Property | ActualRiserHeight | 2013 | `public double ActualRiserHeight { get ; }` |
| Property | ActualRisersNumber | 2013 | `public int ActualRisersNumber { get ; }` |
| Property | ActualTreadDepth | 2013 | `public double ActualTreadDepth { get ; set ; }` |
| Property | ActualTreadsNumber | 2013 | `public int ActualTreadsNumber { get ; }` |
| Property | BaseElevation | 2013 | `public double BaseElevation { get ; }` |
| Property | DesiredRisersNumber | 2013 | `public int DesiredRisersNumber { get ; set ; }` |
| Property | Height | 2013 | `public double Height { get ; set ; }` |
| Property | MultistoryStairsId | 2013 | `public ElementId MultistoryStairsId { get ; }` |
| Property | NumberOfStories | 2013 | `public int NumberOfStories { get ; }` |
| Property | Parameter | — | `` |
| Property | TopElevation | 2013 | `public double TopElevation { get ; }` |